#include <stdio.h>
main(){
 int a,b;
 printf("Введите число в 8-ричной СИ: ");
 scanf("%o",&a); 
 printf("Это же число в 10-тичной СИ: ");
 printf("%d\n",a);
 printf("-----------------------------\n");
 printf("Это же число в 16-ричной СИ: ");
 printf("%X\n",a); 
 printf("Это же число в 16-ричной СИ сдвинутое на 4 бита вправо: ");
 printf("%X\n",a >> 4); 
 printf("--------------------------------------------------------\n");
 printf("Это же число в 16-ричной СИ: ");
 printf("%X\n",a); 
 printf("Это же число в 16-ричной СИ после побитового отрицания: ");
 printf("%X\n",~a); 
 printf("--------------------------------------------------------\n");
 printf("Введи число для операции: ");
 scanf("%X",&b); 
 printf("Результат операции: ");
 printf("%X \n",a & b); 
 return 0;

}
